// 1，什么是数据?
// 存储在内存中代表特定信息的东西, 本质上是 01010101...
// 2.什么是内存
// 内存条通电后产生的可储存数据的空间（内为程序运行时提供临时的运行空间）
// 特点:
// 1) 存储能力不是特别强, 一般就是 1G 2G 4G 8G 16G 32G
// 2) 关机之后空间和数据就消失了
// 3) 存储速度非常快,可以个CPU 进行完美配合

// 内存条的存储大小, 决定了你能同时打开软件程序的数量, 不决定计算速度

// 内存产生和死亡
//  内存条（电路板）==》通电==》产生内存空间==》存储数据 ==》处理数据==》断电==》内存空间和数据消失
// ,

// 计算机用二进制代码标识各种信息

// 运算器组织

// 补码运算基本关系式
    // (X + Y)补 = X 补 + Y补
    // (X - Y)补 = X补 + (-Y)补

// 显卡
// 集成显卡: 是集成到了计算机主板上面,性能刚刚够用,
// 独立显卡: 

// 操作系统是计算机最重要的系统软件:
    // 所有的其他程序都是运行在操作系统上的,
    // 所有的硬件都依靠操作系统来管理

// windows操作系统基本认识
// windows 是一个多任务的操作系统, 多任务的概念是微软首次提出

// 文件是数据,是信息, 所有的文件的使用都会伴随着某个程序的运行